w3ichen/haptic-hand/stm32f4xx_rcc_mort.c
#if defined(STM32F469_479xx)
/**
  * @brief Configures the DSI clock Source.
  * @note This feature is only available for STM32F469_479xx devices.
  * @param RCC_ClockSource: specifies the DSI clock Source.
  *          This parameter can be one of the following values:
  *            @arg RCC_DSICLKSource_PHY: DSI-PHY used as DSI byte lane clock source (usual case).
  *            @arg RCC_DSICLKSource_PLLR: PLL_R used as DSI byte lane clock source, used in case DSI PLL and DSI-PHY are off (low power mode).
  * @retval None
  */
void RCC_DSIClockSourceConfig(uint8_t RCC_ClockSource)
{
  /* Check the parameters */
  assert_param(IS_RCC_DSI_CLOCKSOURCE(RCC_ClockSource));
  
  if(RCC_ClockSource == RCC_DSICLKSource_PLLR)
  {
    SET_BIT_MORT(RCC->DCKCFGR, RCC_DCKCFGR_DSISEL);
  }
  else
  {
    CLEAR_BIT_MORT(RCC->DCKCFGR, RCC_DCKCFGR_DSISEL);
  }
}
#endif /*  STM32F469_479xx */

#if defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx) || defined(STM32F469_479xx)
/**
  * @brief Configures the 48MHz clock Source.
  * @note This feature is only available for STM32F446xx/STM32F469_479xx devices.
  * @param RCC_ClockSource: specifies the 48MHz clock Source.
  *          This parameter can be one of the following values:
  *            @arg RCC_48MHZCLKSource_PLL: 48MHz from PLL selected.
  *            @arg RCC_48MHZCLKSource_PLLSAI: 48MHz from PLLSAI selected.
  *            @arg RCC_CK48CLKSOURCE_PLLI2SQ : 48MHz from PLLI2SQ
  * @retval None
  */
void RCC_48MHzClockSourceConfig(uint8_t RCC_ClockSource)
{
  /* Check the parameters */
  assert_param(IS_RCC_48MHZ_CLOCKSOURCE(RCC_ClockSource));
#if defined(STM32F469_479xx) 
  if(RCC_ClockSource == RCC_48MHZCLKSource_PLLSAI)
  {
    SET_BIT_MORT(RCC->DCKCFGR, RCC_DCKCFGR_CK48MSEL);
  }
  else
  {
    CLEAR_BIT_MORT(RCC->DCKCFGR, RCC_DCKCFGR_CK48MSEL);
  }
#elif  defined(STM32F446xx)
  if(RCC_ClockSource == RCC_48MHZCLKSource_PLLSAI)
  {
    SET_BIT_MORT(RCC->DCKCFGR2, RCC_DCKCFGR2_CK48MSEL_MORT);
  }
  else
  {
    CLEAR_BIT_MORT(RCC->DCKCFGR2, RCC_DCKCFGR2_CK48MSEL_MORT);
  }
#elif defined(STM32F412xG) || defined(STM32F413_423xx)
  if(RCC_ClockSource == RCC_CK48CLKSOURCE_PLLI2SQ)
  {
    SET_BIT_MORT(RCC->DCKCFGR2, RCC_DCKCFGR2_CK48MSEL_MORT);
  }
  else
  {
    CLEAR_BIT_MORT(RCC->DCKCFGR2, RCC_DCKCFGR2_CK48MSEL_MORT);
  }
#else
#endif /* STM32F469_479xx */  
}

/**
  * @brief Configures the SDIO clock Source.
  * @note This feature is only available for STM32F469_479xx/STM32F446xx devices.
  * @param RCC_ClockSource: specifies the SDIO clock Source.
  *          This parameter can be one of the following values:
  *            @arg RCC_SDIOCLKSource_48MHZ: 48MHz clock selected.
  *            @arg RCC_SDIOCLKSource_SYSCLK: system clock selected.
  * @retval None
  */
void RCC_SDIOClockSourceConfig(uint8_t RCC_ClockSource)
{
  /* Check the parameters */
  assert_param(IS_RCC_SDIO_CLOCKSOURCE(RCC_ClockSource));
#if defined(STM32F469_479xx)   
  if(RCC_ClockSource == RCC_SDIOCLKSource_SYSCLK)
  {
    SET_BIT_MORT(RCC->DCKCFGR, RCC_DCKCFGR_SDIOSEL);
  }
  else
  {
    CLEAR_BIT_MORT(RCC->DCKCFGR, RCC_DCKCFGR_SDIOSEL);
  }
#elif defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx)
  if(RCC_ClockSource == RCC_SDIOCLKSource_SYSCLK)
  {
    SET_BIT_MORT(RCC->DCKCFGR2, RCC_DCKCFGR2_SDIOSEL_MORT);
  }
  else
  {
    CLEAR_BIT_MORT(RCC->DCKCFGR2, RCC_DCKCFGR2_SDIOSEL_MORT);
  }
#else
#endif /* STM32F469_479xx */ 
}
#endif /* STM32F412xG || STM32F413_423xx || STM32F446xx || STM32F469_479xx */

#if defined(STM32F446xx)
/**
  * @brief  Enables or disables the AHB1 clock gating for the specified IPs.
  * @note This feature is only available for STM32F446xx devices.
  * @param  RCC_AHB1ClockGating: specifies the AHB1 clock gating.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_AHB1ClockGating_APB1Bridge: AHB1 to APB1 clock
  *            @arg RCC_AHB1ClockGating_APB2Bridge: AHB1 to APB2 clock 
  *            @arg RCC_AHB1ClockGating_CM4DBG: Cortex M4 ETM clock
  *            @arg RCC_AHB1ClockGating_SPARE: Spare clock
  *            @arg RCC_AHB1ClockGating_SRAM: SRAM controller clock
  *            @arg RCC_AHB1ClockGating_FLITF: Flash interface clock
  *            @arg RCC_AHB1ClockGating_RCC: RCC clock
  * @param  NewState: new state of the specified peripheral clock.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHB1ClockGatingCmd(uint32_t RCC_AHB1ClockGating, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_AHB1_CLOCKGATING(RCC_AHB1ClockGating));

  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    RCC->CKGATENR &= ~RCC_AHB1ClockGating;
  }
  else
  {
    RCC->CKGATENR |= RCC_AHB1ClockGating;
  }
}

/**
  * @brief Configures the SPDIFRX clock Source.
  * @note This feature is only available for STM32F446xx devices.
  * @param RCC_ClockSource: specifies the SPDIFRX clock Source.
  *          This parameter can be one of the following values:
  *            @arg RCC_SPDIFRXCLKSource_PLLR: SPDIFRX clock from PLL_R selected.
  *            @arg RCC_SPDIFRXCLKSource_PLLI2SP: SPDIFRX clock from PLLI2S_P selected.
  * @retval None
  */
void RCC_SPDIFRXClockSourceConfig(uint8_t RCC_ClockSource)
{
  /* Check the parameters */
  assert_param(IS_RCC_SPDIFRX_CLOCKSOURCE(RCC_ClockSource));
  
  if(RCC_ClockSource == RCC_SPDIFRXCLKSource_PLLI2SP)
  {
    SET_BIT_MORT(RCC->DCKCFGR2, RCC_DCKCFGR2_SPDIFRXSEL_MORT);
  }
  else
  {
    CLEAR_BIT_MORT(RCC->DCKCFGR2, RCC_DCKCFGR2_SPDIFRXSEL_MORT);
  }
}

/**
  * @brief Configures the CEC clock Source.
  * @note This feature is only available for STM32F446xx devices.
  * @param RCC_ClockSource: specifies the CEC clock Source.
  *          This parameter can be one of the following values:
  *            @arg RCC_CECCLKSource_HSIDiv488: CEC clock from HSI/488 selected.
  *            @arg RCC_CECCLKSource_LSE: CEC clock from LSE selected.
  * @retval None
  */
void RCC_CECClockSourceConfig(uint8_t RCC_ClockSource)
{
  /* Check the parameters */
  assert_param(IS_RCC_CEC_CLOCKSOURCE(RCC_ClockSource));
  
