w3ichen/haptic-hand/stm32f4xx_rcc_mort.c
  if(RCC_ClockSource == RCC_CECCLKSource_LSE)
  {
    SET_BIT_MORT(RCC->DCKCFGR2, RCC_DCKCFGR2_CECSEL_MORT);
  }
  else
  {
    CLEAR_BIT_MORT(RCC->DCKCFGR2, RCC_DCKCFGR2_CECSEL_MORT);
  }
}
#endif /* STM32F446xx */

#if defined(STM32F410xx) || defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx)
/**
  * @brief Configures the FMPI2C1 clock Source.
  * @note This feature is only available for STM32F446xx devices.
  * @param RCC_ClockSource: specifies the FMPI2C1 clock Source.
  *          This parameter can be one of the following values:
  *            @arg RCC_FMPI2C1CLKSource_APB1: FMPI2C1 clock from APB1 selected.
  *            @arg RCC_FMPI2C1CLKSource_SYSCLK: FMPI2C1 clock from Sytem clock selected.
  *            @arg RCC_FMPI2C1CLKSource_HSI: FMPI2C1 clock from HSI selected.
  * @retval None
  */
void RCC_FMPI2C1ClockSourceConfig(uint32_t RCC_ClockSource)
{
  /* Check the parameters */
  assert_param(IS_RCC_FMPI2C1_CLOCKSOURCE(RCC_ClockSource));

  /* Clear FMPI2C1 clock source selection source bits */
  RCC->DCKCFGR2 &= ~RCC_DCKCFGR2_FMPI2C1SEL_MORT;
  /* Set new FMPI2C1 clock source */
  RCC->DCKCFGR2 |= RCC_ClockSource;
}
#endif /* STM32F410xx || STM32F412xG || STM32F413_423xx || STM32F446xx */
/**
  * @}
  */

#if defined(STM32F410xx)
/**
  * @brief  Enables or disables the MCO1.
  * @param  NewState: new state of the MCO1.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_MCO1Cmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  *(__IO uint32_t *) RCC_CFGR_MCO1EN_BB = (uint32_t)NewState;
}

/**
  * @brief  Enables or disables the MCO2.
  * @param  NewState: new state of the MCO2.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_MCO2Cmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  *(__IO uint32_t *) RCC_CFGR_MCO2EN_BB = (uint32_t)NewState;
}
#endif /* STM32F410xx */

/** @defgroup RCC_Group4 Interrupts and flags management functions
 *  @brief   Interrupts and flags management functions 
 *
@verbatim   
 ===============================================================================
                ##### Interrupts and flags management functions #####
 ===============================================================================  

@endverbatim
  * @{
  */

/**
  * @brief  Enables or disables the specified RCC interrupts.
  * @param  RCC_IT: specifies the RCC interrupt sources to be enabled or disabled.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY_MORT: LSI ready interrupt
  *            @arg RCC_IT_LSERDY_MORT: LSE ready interrupt
  *            @arg RCC_IT_HSIRDY_MORT: HSI ready interrupt
  *            @arg RCC_IT_HSERDY_MORT: HSE ready interrupt
  *            @arg RCC_IT_PLLRDY_MORT: main PLL ready interrupt
  *            @arg RCC_IT_PLLI2SRDY_MORT: PLLI2S ready interrupt
  *            @arg RCC_IT_PLLSAIRDY_MORT: PLLSAI ready interrupt (only for STM32F42xxx/43xxx/446xx/469xx/479xx devices)
  * @param  NewState: new state of the specified RCC interrupts.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_ITConfig(uint8_t RCC_IT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_IT(RCC_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    /* Perform Byte access to RCC_CIR[14:8] bits to enable the selected interrupts */
    *(__IO uint8_t *) CIR_BYTE2_ADDRESS |= RCC_IT;
  }
  else
  {
    /* Perform Byte access to RCC_CIR[14:8] bits to disable the selected interrupts */
    *(__IO uint8_t *) CIR_BYTE2_ADDRESS &= (uint8_t)~RCC_IT;
  }
}

/**
  * @brief  Checks whether the specified RCC flag is set or not.
  * @param  RCC_FLAG: specifies the flag to check.
  *          This parameter can be one of the following values:
  *            @arg RCC_FLAG_HSIRDY_MORT: HSI oscillator clock ready
  *            @arg RCC_FLAG_HSERDY_MORT: HSE oscillator clock ready
  *            @arg RCC_FLAG_PLLRDY_MORT: main PLL clock ready
  *            @arg RCC_FLAG_PLLI2SRDY_MORT: PLLI2S clock ready
  *            @arg RCC_FLAG_PLLSAIRDY_MORT: PLLSAI clock ready (only for STM32F42xxx/43xxx/446xx/469xx/479xx devices)
  *            @arg RCC_FLAG_LSERDY_MORT: LSE oscillator clock ready
  *            @arg RCC_FLAG_LSIRDY_MORT: LSI oscillator clock ready
  *            @arg RCC_FLAG_BORRST_MORT: POR/PDR or BOR reset
  *            @arg RCC_FLAG_PINRST_MORT: Pin reset
  *            @arg RCC_FLAG_PORRST_MORT: POR/PDR reset
  *            @arg RCC_FLAG_SFTRST_MORT: Software reset
  *            @arg RCC_FLAG_IWDGRST_MORT: Independent Watchdog reset
  *            @arg RCC_FLAG_WWDGRST_MORT: Window Watchdog reset
  *            @arg RCC_FLAG_LPWRRST_MORT: Low Power reset
  * @retval The new state of RCC_FLAG (SET or RESET).
  */
FlagStatus RCC_GetFlagStatus(uint8_t RCC_FLAG)
{
  uint32_t tmp = 0;
  uint32_t statusreg = 0;
  FlagStatus bitstatus = RESET;

  /* Check the parameters */
  assert_param(IS_RCC_FLAG(RCC_FLAG));

  /* Get the RCC register index */
  tmp = RCC_FLAG >> 5;
  if (tmp == 1)               /* The flag to check is in CR register */
  {
    statusreg = RCC->CR;
  }
  else if (tmp == 2)          /* The flag to check is in BDCR register */
  {
    statusreg = RCC->BDCR;
  }
  else                       /* The flag to check is in CSR register */
  {
    statusreg = RCC->CSR;
  }

  /* Get the flag position */
  tmp = RCC_FLAG & FLAG_MASK;
  if ((statusreg & ((uint32_t)1 << tmp)) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  /* Return the flag status */
  return bitstatus;
}

/**
  * @brief  Clears the RCC reset flags.
  *         The reset flags are: RCC_FLAG_PINRST_MORT, RCC_FLAG_PORRST_MORT,  RCC_FLAG_SFTRST_MORT,
  *         RCC_FLAG_IWDGRST_MORT, RCC_FLAG_WWDGRST_MORT, RCC_FLAG_LPWRRST_MORT
  * @param  None
  * @retval None
  */
void RCC_ClearFlag(void)
{
  /* Set RMVF bit to clear the reset flags */
  RCC->CSR |= RCC_CSR_RMVF_MORT;
}

/**
  * @brief  Checks whether the specified RCC interrupt has occurred or not.
  * @param  RCC_IT: specifies the RCC interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg RCC_IT_LSIRDY_MORT: LSI ready interrupt
  *            @arg RCC_IT_LSERDY_MORT: LSE ready interrupt
  *            @arg RCC_IT_HSIRDY_MORT: HSI ready interrupt
  *            @arg RCC_IT_HSERDY_MORT: HSE ready interrupt
  *            @arg RCC_IT_PLLRDY_MORT: main PLL ready interrupt
  *            @arg RCC_IT_PLLI2SRDY_MORT: PLLI2S ready interrupt
  *            @arg RCC_IT_PLLSAIRDY_MORT: PLLSAI clock ready interrupt (only for STM32F42xxx/43xxx/446xx/469xx/479xx devices)
  *            @arg RCC_IT_CSS_MORT: Clock Security System interrupt
  * @retval The new state of RCC_IT (SET or RESET).
  */
ITStatus RCC_GetITStatus(uint8_t RCC_IT)
{
  ITStatus bitstatus = RESET;

  /* Check the parameters */
  assert_param(IS_RCC_GET_IT(RCC_IT));

  /* Check the status of the specified RCC interrupt */
  if ((RCC->CIR & RCC_IT) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  /* Return the RCC_IT status */
  return  bitstatus;
}

/**
  * @brief  Clears the RCC's interrupt pending bits.
  * @param  RCC_IT: specifies the interrupt pending bit to clear.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY_MORT: LSI ready interrupt
  *            @arg RCC_IT_LSERDY_MORT: LSE ready interrupt
  *            @arg RCC_IT_HSIRDY_MORT: HSI ready interrupt
  *            @arg RCC_IT_HSERDY_MORT: HSE ready interrupt
  *            @arg RCC_IT_PLLRDY_MORT: main PLL ready interrupt
  *            @arg RCC_IT_PLLI2SRDY_MORT: PLLI2S ready interrupt  
  *            @arg RCC_IT_PLLSAIRDY_MORT: PLLSAI ready interrupt (only for STM32F42xxx/43xxx/446xx/469xx/479xx devices) 
  *            @arg RCC_IT_CSS_MORT: Clock Security System interrupt
  * @retval None
  */
void RCC_ClearITPendingBit(uint8_t RCC_IT)
{
  /* Check the parameters */
  assert_param(IS_RCC_CLEAR_IT(RCC_IT));

  /* Perform Byte access to RCC_CIR[23:16] bits to clear the selected interrupt
     pending bits */
  *(__IO uint8_t *) CIR_BYTE3_ADDRESS = RCC_IT;
}

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/